# THIS FILE IS AUTOMATICALLY GENERATED
# Project: \\mightor\home\spring2013\gmh5970\Documents\PSoC Creator\HelloWorld_Blinky01\Project2.cydsn\Project2.cyprj
# Date: Thu, 19 Oct 2017 20:31:27 GMT
#set_units -time ns
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 96001 192001} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_clock -name {Clock_1(fixed-function)} -period 4000000 -waveform {0 41.6666666666667} [get_pins {ClockBlock/dclk_glb_ff_0}]
create_generated_clock -name {ADC_SAR_1_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 13 27} -nominal_period 541.66666666666663 [list [get_pins {ClockBlock/aclk_glb_0}]]
create_clock -name {ADC_SAR_1_theACLK(fixed-function)} -period 541.66666666666663 -waveform {0 270.833333333333} -nominal_period 541.66666666666663 [get_pins {ClockBlock/aclk_glb_ff_0}]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for \\mightor\home\spring2013\gmh5970\Documents\PSoC Creator\HelloWorld_Blinky01\Project2.cydsn\TopDesign\TopDesign.cysch
# Project: \\mightor\home\spring2013\gmh5970\Documents\PSoC Creator\HelloWorld_Blinky01\Project2.cydsn\Project2.cyprj
# Date: Thu, 19 Oct 2017 20:31:21 GMT
